/**
  ******************************************************************************
  * @file    ID.h
  * @author  IMD, Sledin
  * @version V1.0.0
  * @date    18-06-2013
  * @brief  Модуль, формирующий ID-строку устройства
  ******************************************************************************
  * @Заметки:
  *
  * 
  * 
  * 
  * 
  * 
  *
  * 
  ******************************************************************************
  */
#ifndef ID_H
#define ID_H
#include "stm32f4xx.h"// basic types


extern char DeviceID[256];//объявление символьного массива для ID-строки

extern void IDinit(u32 SN, char* ID_text);//функция, формирующая ID-строку


#endif
