/**
  ******************************************************************************
  * @file    CDdata.с
  * @author  IMD, Sledin
  * @version V1.0.0
  * @date    18-06-2013
  * @brief   ‘айл содержит инициализацию структур, располагаемых в секторе 
  *          калибровочных данных .
  ******************************************************************************
  * @«аметки:
  ******************************************************************************
  */
#include "modbus_data.h"//содержит описани€ структур данных
#pragma section = ".cdsection"
const TCD_DATA CD_DATA @ ".cdsection" =
{
    8,  //u32 serial_number;//0,1
    0x0401, //Modbus_RS485;
    10, //u16 tdir_Modbus1_RS485;//2      
    10, //u16 tdir_Modbus2_USB;//3
    5000,   //u16 lnk_mngr_t_TO;//7
//    100,   //u16 lnk_mngr_t_ChSl;//8
//    10,     //u16 lnk_mngr_t_DIR;//9
    
   0,
   0,
//   0,
//   0,
//   0,
//   0,
//   0,
//   0,
//   0,
//   0,
//   0,
   
   1.0,
   1.0,
//   1.0,
//   1.0,
//   1.0,
//   1.0,
//   1.0,
//   1.0,
//   1.0,
//   1.0,
//   1.0
};