
/**
  ******************************************************************************
  * @file    ramdata.h
  * @author  IMD, Sledin
  * @version V1.0.0
  * @date    18-06-2013
  * @brief   Файл содержит объявление структуры общедоступных переменных (для
  * ModBus) глобальных переменных, глобальных макросов.
  ******************************************************************************
  */
#ifndef RAMDATA_H
#define RAMDATA_H
#include "modbus_data.h"//содержит описания структур данных
/* Ниже представлены  макросы для управления светодиодами
  ******************************************************************************
  * LEDx_ON - зажечь светодиод х, где х-номер светодиода (1 или 2)
  * LEDx_OFF - погасить светодиод х, где х-номер светодиода (1 или 2)
  * 
  * Макросы прописываются индивидуально для каждого приложения 
  * (зависит от того, какой микроконтроллер используется, 
  * на какие пины каких портов посажены сигналы управления, смотри схему)
  ******************************************************************************
  */
#define LED_ALRM_ON    GPIOC->BSRRH = GPIO_Pin_13
#define LED_ALRM_OFF   GPIOC->BSRRL = GPIO_Pin_13
#define LED_ALRM_ST    (GPIOC->ODR & GPIO_Pin_13)
#define LED_LINK_OFF   GPIOC->BSRRH = GPIO_Pin_14
#define LED_LINK_ON    GPIOC->BSRRL = GPIO_Pin_14
#define LED_LINK_ST    (GPIOC->ODR & GPIO_Pin_14)
    
  

//параметры расположеные RAM
extern TRAM_DATA RAM_DATA;

extern u16 FLASH_change;
extern u16 period_over;

extern u16 AIN_buf[12];



#endif